[
  {
    "id": 1,
    "title": "Senior Fullstack Engineer",
    "company": "INDTACT GMBH",
    "duration": "10/2024 - 12/2024 (2 months)",
    "technologies": [
      "Typescript",
      "Vue",
      "Nuxt",
      "Tailwind CSS",
      "Node.js",
      "WebSocket",
      "Drizzle ORM",
      "PostgreSQL",
      "Zod"
    ],
    "description": "I developed the frontend and BFF (Backend-for-Frontend) for a quality assurance system used in automotive manufacturing. The system interfaces with specialized Bluetooth devices (SmartClicks) to collect sound signatures and ensure correct connector installations. My responsibilities included:",
    "bullets": [
      "Architecting a domain-driven frontend structure using Nuxt and TypeScript",
      "Implementing real-time WebSocket connections for data collection and live monitoring",
      "Building a device management dashboard for gateway and SmartClick configuration",
      "Creating data collection interfaces for sound signature recording and labeling",
      "Designing and implementing RESTful APIs using Drizzle ORM and PostgreSQL",
      "Developing real-time visualizations for connection quality feedback"
    ]
  },
  {
    "id": 2,
    "title": "Senior Fullstack Engineer",
    "company": "SMG",
    "duration": "11/2023 - 12/2024 (1 year, 1 months)",
    "technologies": [
      "Typescript",
      "Vue",
      "Vite",
      "Vitest",
      "Node.js",
      "AWS (Api Gateway, Cloudfront, Lambda, SQS, SNS, CDK)",
      "Datadog",
      "Git"
    ],
    "description": "I worked with an international team to improve the sales funnels of Homegate.ch and Immoscout24.ch. I led the upgrades of the frontend from Vue 2 to Vue 3 and the backend infrastructure from Serverless to AWS CDK. I set up Datadog monitoring and applied SRE principles to enhance reliability and performance. My focus was on:",
    "bullets": [
      "Migrating to AWS CDK for better infrastructure management",
      "Planning and executing Vue 2 to Vue 3 upgrade",
      "Implementing Datadog and SRE practices to boost reliability",
      "Improving the dev environment for higher code quality and developer productivity"
    ]
  },
  {
    "id": 3,
    "title": "Senior Frontend Engineer",
    "company": "Mercedes-benz.io",
    "duration": "12/2021 - 09/2023 (1 year, 10 months)",
    "technologies": [
      "TypeScript",
      "Vue",
      "Vite",
      "Vitest",
      "Nuxt",
      "Tailwind CSS",
      "Pinia",
      "VueX",
      "Jest",
      "GitHub",
      "Kubernetes",
      "Jenkins",
      "SonarQube",
      "Helm Charts"
    ],
    "description": "As part of an international team, I contributed to developing the Mercedes Me web storefront. My responsibilities included:",
    "bullets": [
      "Defining feature specifications and coordinating with external teams",
      "Leading a team of 5-8 developers",
      "Driving the upgrade from Vue 2 to Vue 3",
      "Migrating the test suite from Jest to Vitest",
      "Implementing TypeScript",
      "Building new features and DevOps pipelines",
      "Debugging frontend issues",
      "Improving code quality and security"
    ]
  },
  {
    "id": 4,
    "title": "Senior Fullstack Engineer",
    "company": "Auteon",
    "duration": "10/2021 - 04/2022 (6 months)",
    "technologies": [
      "TypeScript",
      "Vue",
      "Webpack",
      "Node.js",
      "Google Cloud Functions",
      "Cheerio",
      "Puppeteer",
      "Postman",
      "GraphQL",
      "Hasura"
    ],
    "description": "I built a proof of concept to reverse engineer automotive eCommerce websites and create a web scraping service. After completing it, I trained other developers on how to use it. My work involved:",
    "bullets": [
      "Analyzing target websites to understand their structure",
      "Examining source code and network requests",
      "Identifying roadblocks like CAPTCHAs or AJAX calls",
      "Writing the scraping logic in TypeScript and Node.js",
      "Creating Postman tests to validate data extraction",
      "Documenting the scraping service architecture",
      "Training developers on using the service"
    ]
  },
  {
    "id": 5,
    "title": "Fullstack Engineer",
    "company": "Ruhrkraft GmbH",
    "duration": "09/2020 - 09/2021 (1 year)",
    "technologies": ["TypeScript", "Vue", "VueX", "React", "Meteor", "Node.js", "Jest"],
    "description": "I designed and built a scheduler for a Digital Signage CMS. This allowed users to easily plan, schedule, and upload ad campaigns to be displayed on screens in multiple locations. My main goals were:",
    "bullets": [
      "Developing an intuitive interface for managing campaigns",
      "Writing algorithms to prevent ad overlap and enable smooth transitions",
      "Ensuring compatibility across various screen sizes and resolutions",
      "Creating a robust data structure for campaigns and playlists",
      "Thoroughly testing to guarantee reliable display on all screens"
    ]
  },
  {
    "id": 6,
    "title": "Fullstack Engineer",
    "company": "Westend Druckereibetriebe",
    "duration": "01/2018 - 07/2021 (3 years, 6 months)",
    "technologies": [
      "TypeScript",
      "Vue",
      "Tailwind CSS",
      "Meteor",
      "Node.js",
      "React",
      "VueX",
      "Cypress",
      "Jest",
      "Docker"
    ],
    "description": "At this major printing company, I was tasked with improving their digital processes. I designed and developed an order placement application that served as the main interface between the company and customers. I also created comprehensive end-to-end and unit test suites to ensure the app was reliable and bug-free. My key activities included:",
    "bullets": [
      "Designing UIs and workflows for the order app",
      "Implementing and iterating on application features",
      "Monitoring user feedback and making improvements",
      "Building a full test suite using TDD, including E2E and unit tests",
      "Collaborating with cross-functional teams on cohesive development strategies"
    ]
  }
]
